#### VectorAtPoint Members

---

|  |
| --- |
| VectorAtPoint Class   Constructors   Methods   Properties   See Also |

The  VectorAtPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | VectorAtPoint(VectorAtPoint) | Creates a copy of the given VectorAtPoint instance. |
| Public method | VectorAtPoint(IList XYZ ) | Creates object from an array of vectors |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | ClearAllFlags | Sets flags for all measurements to ValueAtPointFlags::None. (Inherited from  ValueAtPointBase  .) |
| Public method | ClearFlagsAt | Sets flags for the given measurement to ValueAtPointFlags::None. (Inherited from  ValueAtPointBase  .) |
| Public method | Dispose | (Inherited from  ValueAtPointBase  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFlags | Returns flags for the given measurement. (Inherited from  ValueAtPointBase  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetFlags(IList Int32 ) | Independently sets the flags associated to all measurements. (Inherited from  ValueAtPointBase  .) |
| Public method | SetFlags(Int32) | Sets the flags associated to all measurements to the same value. (Inherited from  ValueAtPointBase  .) |
| Public method | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. (Inherited from  ValueAtPointBase  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ValueAtPointBase  .) |

# See Also

VectorAtPoint Class

Autodesk.Revit.DB.Analysis Namespace